app/Controllers/Ajax/Usuarios.php

SELECT `id`, `nome`, `sobrenome`, `login`, `email`
FROM `usuarios`
---
    public function getDados(){
        $usuariosModel =  new UsuarioModel();

        $usuariosModel->select('id, nome, sobrenome, login, email');
        $usuarios = $usuariosModel->findAll();